#### Profile Members

---

|  |
| --- |
| Profile Class   Methods   Properties   See Also |

The  Profile  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Clone | Returns a copy of this profile. |
| Public method | Dispose | Causes the object to release immediately any resources it may be utilizing. (Inherited from  APIObject  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  GeometryObject  .) |
| Public method | GetHashCode | Gets the integer value of the geometry object as hash code (Inherited from  GeometryObject  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Curves | Retrieve the curves that make up the boundary of the profile. |
| Public property | Filled | Get or set whether the profile is filled. |
| Public property | GraphicsStyleId | The ElementId of the GeometryObject's GraphicsStyle (Inherited from  GeometryObject  .) |
| Public property | Id | A unique integer identifying the GeometryObject in its associated non view-specific GeometryElement. (Inherited from  GeometryObject  .) |
| Public property | IsElementGeometry | Indicates whether this geometry is obtained directly from an Element. (Inherited from  GeometryObject  .) |
| Public property | IsReadOnly | Identifies if the object is read-only or modifiable. (Inherited from  APIObject  .) |
| Public property | Transformed | Transforms this profile and returns the result. |
| Public property | Visibility | The visibility. (Inherited from  GeometryObject  .) |

# See Also

Profile Class

Autodesk.Revit.DB Namespace